-- --------------------------------------------------------
-- 호스트:                          192.168.0.240
-- 서버 버전:                        10.2.17-MariaDB-log - mariadb.org binary distribution
-- 서버 OS:                        Win64
-- HeidiSQL 버전:                  11.3.0.6295
-- --------------------------------------------------------

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET NAMES utf8 */;
/*!50503 SET NAMES utf8mb4 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

-- 테이블 데이터 wato_commuting_management_db.commuting_history_tb:~68 rows (대략적) 내보내기
DELETE FROM `commuting_history_tb`;
/*!40000 ALTER TABLE `commuting_history_tb` DISABLE KEYS */;
INSERT INTO `commuting_history_tb` (`date_key`, `name`, `attendance`, `leave_work`) VALUES
	('20220103이재규', '이재규', '2022-01-03 08:55:30', '2022-01-03 18:00:30'),
	('20220104이재규', '이재규', '2022-01-04 09:01:29', '2022-01-04 17:56:50'),
	('20220105이재규', '이재규', '2022-01-05 08:58:32', '2022-01-05 18:00:15'),
	('20220106이재규', '이재규', '2022-01-06 08:59:10', '2022-01-06 18:02:54'),
	('20220107이재규', '이재규', '2022-01-07 09:00:29', '2022-01-07 18:00:26'),
	('20220110이재규', '이재규', '2022-01-10 08:50:16', '2022-01-10 18:02:13'),
	('20220111이재규', '이재규', '2022-01-11 09:00:30', '2022-01-11 18:00:03'),
	('20220112이재규', '이재규', '2022-01-12 09:01:39', '2022-01-12 09:01:39'),
	('20220113이재규', '이재규', '2022-01-13 08:56:50', '2022-01-13 08:56:50'),
	('20220117이재규', '이재규', '2022-01-17 08:45:30', '2022-01-17 08:45:30'),
	('20220118이재규', '이재규', '2022-01-18 08:53:22', '2022-01-18 18:00:00'),
	('20220119이재규', '이재규', '2022-01-19 08:45:00', '2022-01-19 17:57:16'),
	('20220120이재규', '이재규', '2022-01-20 08:55:43', '2022-01-20 17:58:09'),
	('20220121이재규', '이재규', '2022-01-21 09:02:35', '2022-01-21 18:01:38'),
	('20220124이재규', '이재규', '2022-01-24 08:48:24', '2022-01-24 18:02:51'),
	('20220125이재규', '이재규', '2022-01-25 09:04:51', '2022-01-25 18:02:34'),
	('20220126이재규', '이재규', '2022-01-26 08:57:35', '2022-01-26 18:00:10'),
	('20220127이재규', '이재규', '2022-01-27 08:54:41', '2022-01-27 18:00:07'),
	('20220204이재규', '이재규', '2022-02-04 08:55:46', '2022-02-04 18:01:10'),
	('20220207이재규', '이재규', '2022-02-07 08:57:33', '2022-02-07 18:14:41'),
	('20220208이재규', '이재규', '2022-02-08 08:50:41', '2022-02-08 18:02:26'),
	('20220209이재규', '이재규', '2022-02-09 08:56:54', '2022-02-09 18:00:11'),
	('20220210이재규', '이재규', '2022-02-10 08:55:11', '2022-02-10 18:01:55'),
	('20220211이재규', '이재규', '2022-02-11 08:56:46', '2022-02-11 18:01:02'),
	('20220214이재규', '이재규', '2022-02-14 08:57:25', '2022-02-14 18:00:05'),
	('20220215이재규', '이재규', '2022-02-15 09:04:09', '2022-02-15 18:00:21'),
	('20220216이재규', '이재규', '2022-02-16 08:57:31', '2022-02-16 18:00:11'),
	('20220217이재규', '이재규', '2022-02-17 08:47:27', '2022-02-17 18:00:11'),
	('20220218이재규', '이재규', '2022-02-18 08:51:19', '2022-02-18 18:00:06'),
	('20220221이재규', '이재규', '2022-02-21 08:43:07', '2022-02-21 12:00:02'),
	('20220223이재규', '이재규', '2022-02-23 09:02:09', '2022-02-23 18:00:29'),
	('20220224이재규', '이재규', '2022-02-24 08:53:41', '2022-02-24 18:00:03'),
	('20220228이재규', '이재규', '2022-02-28 08:59:00', '2022-02-28 12:02:36'),
	('20220302이재규', '이재규', '2022-03-02 08:44:16', '2022-03-02 18:00:22'),
	('20220303이재규', '이재규', '2022-03-03 08:54:39', '2022-03-03 18:06:50'),
	('20220304이재규', '이재규', '2022-03-04 08:52:35', '2022-03-04 18:00:00'),
	('20220307이재규', '이재규', '2022-03-07 08:45:35', '2022-03-07 18:00:23'),
	('20220308이재규', '이재규', '2022-03-08 08:58:11', '2022-03-08 18:00:31'),
	('20220310이재규', '이재규', '2022-03-10 08:50:04', '2022-03-10 18:03:40'),
	('20220311이재규', '이재규', '2022-03-11 08:57:31', '2022-03-11 18:00:58'),
	('20220314이재규', '이재규', '2022-03-14 08:59:56', '2022-03-14 18:00:26'),
	('20220315이재규', '이재규', '2022-03-15 09:02:21', '2022-03-15 18:00:18'),
	('20220316이재규', '이재규', '2022-03-16 08:58:14', '2022-03-16 18:01:15'),
	('20220317이재규', '이재규', '2022-03-10 08:57:56', '2022-03-17 18:06:58'),
	('20220318이재규', '이재규', '2022-03-18 08:53:20', '2022-03-18 20:33:37'),
	('20220418이재규', '이재규', '2022-04-18 08:57:24', '2022-04-18 18:00:57'),
	('20220419이재규', '이재규', '2022-04-19 08:59:56', '2022-04-19 18:00:25'),
	('20220420이재규', '이재규', '2022-04-20 08:55:15', '2022-04-19 17:59:29'),
	('20220421이재규', '이재규', '2022-03-21 08:44:54', '2022-03-21 18:00:05'),
	('20220422이재규', '이재규', '2022-04-22 09:00:02', '2022-04-21 18:01:02'),
	('20220425이재규', '이재규', '2022-04-25 08:32:02', '2022-04-25 18:32:05'),
	('20220426이재규', '이재규', '2022-04-26 09:00:41', '2022-04-26 17:59:50'),
	('20220427이재규', '이재규', '2022-04-27 09:01:43', '2022-04-27 18:01:47'),
	('20220428이재규', '이재규', '2022-04-28 09:05:59', '2022-04-28 18:00:01'),
	('20220502이재규', '이재규', '2022-05-02 09:00:41', '2022-05-02 18:05:55'),
	('20220503이재규', '이재규', '2022-05-03 17:27:11', '2022-05-03 17:58:15'),
	('20220504이재규', '이재규', '2022-05-04 17:27:11', '2022-05-04 17:59:15'),
	('20220506이재규', '이재규', '2022-05-06 08:57:17', '2022-05-06 18:02:04'),
	('20220509이재규', '이재규', '2022-05-09 09:01:06', '2022-05-09 18:00:05'),
	('20220510이재규', '이재규', '2022-05-10 08:58:02', '2022-05-10 17:57:05'),
	('20220511이재규', '이재규', '2022-05-11 08:59:04', '2022-05-11 18:06:18'),
	('20220512이재규', '이재규', '2022-05-12 08:59:35', '2022-05-12 18:04:01'),
	('20220513이재규', '이재규', '2022-05-13 09:00:48', '2022-05-13 12:07:50'),
	('20220516이재규', '이재규', '2022-05-16 09:00:34', '2022-05-16 18:00:53'),
	('20220517이재규', '이재규', '2022-05-17 09:00:48', '2022-05-17 18:01:34'),
	('20220519이재규', '이재규', '2022-05-19 13:45:24', '2022-05-19 18:05:22'),
	('20220520이재규', '이재규', '2022-05-20 09:01:45', '2022-05-20 17:58:49'),
	('20220523이재규', '이재규', '2022-05-23 08:52:54', '2022-05-23 18:00:00');
/*!40000 ALTER TABLE `commuting_history_tb` ENABLE KEYS */;

-- 테이블 데이터 wato_commuting_management_db.forum_comment_tb:~0 rows (대략적) 내보내기
DELETE FROM `forum_comment_tb`;
/*!40000 ALTER TABLE `forum_comment_tb` DISABLE KEYS */;
/*!40000 ALTER TABLE `forum_comment_tb` ENABLE KEYS */;

-- 테이블 데이터 wato_commuting_management_db.forum_tb:~2 rows (대략적) 내보내기
DELETE FROM `forum_tb`;
/*!40000 ALTER TABLE `forum_tb` DISABLE KEYS */;
INSERT INTO `forum_tb` (`pk`, `title`, `content`, `name`, `type`, `create date`, `last_revised_date`) VALUES
	('TEST 테스트', 'TEST', 'FORUM ADD TEST', '테스트', '일반', '2022-01-19 17:58:31', '2022-01-19 17:58:46'),
	('게시판 테스트 이재규', '게시판 테스트', '게시판 테스트게시판 테스트\r\n게시판 테스트게시판 테스트게시판 테스트\r\n게시판 테스트게시판 테스트게시판 테스트게시판 테스트\r\n게시판 테스트게시판 테스트게시판 테스트게시판 테스트게시판 테스트\r\n게시판 테스트게시판 테스트게시판 테스트게시판 테스트\r\n게시판 테스트게시판 테스트게시판 테스트\r\n게시판 테스트게시판 테스트\r\n게시판 테스트게시판 테스트\r\n게시판 테스트게시판 테스트게시판 테스트\r\n게시판 테스트게시판 테스트게시판 테스트게시판 테스트\r\n게시판 테스트게시판 테스트게시판 테스트게시판 테스트게시판 테스트\r\n게시판 테스트게시판 테스트게시판 테스트게시판 테스트\r\n게시판 테스트게시판 테스트게시판 테스트\r\n게시판 테스트게시판 테스트\r\n게시판 테스트게시판 테스트\r\n게시판 테스트게시판 테스트게시판 테스트\r\n게시판 테스트게시판 테스트게시판 테스트게시판 테스트\r\n게시판 테스트게시판 테스트게시판 테스트게시판 테스트게시판 테스트\r\n게시판 테스트게시판 테스트게시판 테스트게시판 테스트\r\n게시판 테스트게시판 테스트게시판 테스트\r\n게시판 테스트게시판 테스트\r\n게시판 테스트게시판 테스트\r\n게시판 테스트게시판 테스트게시판 테스트\r\n게시판 테스트게시판 테스트게시판 테스트게시판 테스트\r\n게시판 테스트게시판 테스트게시판 테스트게시판 테스트게시판 테스트\r\n게시판 테스트게시판 테스트게시판 테스트게시판 테스트\r\n게시판 테스트게시판 테스트게시판 테스트\r\n게시판 테스트게시판 테스트\r\n게시판 테스트게시판 테스트\r\n게시판 테스트게시판 테스트게시판 테스트\r\n게시판 테스트게시판 테스트게시판 테스트게시판 테스트\r\n게시판 테스트게시판 테스트게시판 테스트게시판 테스트게시판 테스트\r\n게시판 테스트게시판 테스트게시판 테스트게시판 테스트\r\n게시판 테스트게시판 테스트게시판 테스트\r\n게시판 테스트게시판 테스트\r\n게시판 테스트게시판 테스트\r\n게시판 테스트게시판 테스트게시판 테스트\r\n게시판 테스트게시판 테스트게시판 테스트게시판 테스트\r\n게시판 테스트게시판 테스트게시판 테스트게시판 테스트게시판 테스트\r\n게시판 테스트게시판 테스트게시판 테스트게시판 테스트\r\n게시판 테스트게시판 테스트게시판 테스트\r\n게시판 테스트게시판 테스트\r\n게시판 테스트게시판 테스트\r\n게시판 테스트게시판 테스트게시판 테스트\r\n게시판 테스트게시판 테스트게시판 테스트게시판 테스트\r\n게시판 테스트게시판 테스트게시판 테스트게시판 테스트게시판 테스트\r\n게시판 테스트게시판 테스트게시판 테스트게시판 테스트\r\n게시판 테스트게시판 테스트게시판 테스트\r\n게시판 테스트게시판 테스트', '이재규', '일반', '2022-01-18 13:55:10', '2022-01-18 17:30:41');
/*!40000 ALTER TABLE `forum_tb` ENABLE KEYS */;

-- 테이블 데이터 wato_commuting_management_db.user_tb:~3 rows (대략적) 내보내기
DELETE FROM `user_tb`;
/*!40000 ALTER TABLE `user_tb` DISABLE KEYS */;
INSERT INTO `user_tb` (`name`, `position`, `vacation_count`, `mail`, `pin_pw`, `online_check`, `authority`, `memo`) VALUES
	('신승철', '대리', 15, '', '03AC674216F3E15C761EE1A5E255F067953623C8B388B4459E13F978D7C846F4', 'offline', 'user', '324234'),
	('이재규', '사원', 4.5, 'jk.lee@watosolution.com', '41c991eb6a66242c0454191244278183ce58cf4a6bcd372f799e4b9cc01886af', 'offline', 'admin', ''),
	('테스트', '테스트', 15, '', '3b47492744946d5a188be73c702fb2e3cd1b635433f841381ae8d2e0ed67b45f', 'offline', 'user', 'memo add test');
/*!40000 ALTER TABLE `user_tb` ENABLE KEYS */;

-- 테이블 데이터 wato_commuting_management_db.vacation_tb:~12 rows (대략적) 내보내기
DELETE FROM `vacation_tb`;
/*!40000 ALTER TABLE `vacation_tb` DISABLE KEYS */;
INSERT INTO `vacation_tb` (`date_key`, `name`, `vac_type`, `vac_date`) VALUES
	('2022-01-14이재규', '이재규', '연차', '2022-01-14 00:00:00'),
	('2022-01-28이재규', '이재규', '연차', '2022-01-28 00:00:00'),
	('2022-02-03이재규', '이재규', '연차', '2022-02-03 00:00:00'),
	('2022-02-21이재규', '이재규', '반차', '2022-02-21 00:00:00'),
	('2022-02-22이재규', '이재규', '연차', '2022-02-22 00:00:00'),
	('2022-02-25이재규', '이재규', '연차', '2022-02-25 00:00:00'),
	('2022-02-28이재규', '이재규', '반차', '2022-02-28 00:00:00'),
	('2022-03-22이재규', '이재규', '연차', '2022-03-22 00:00:00'),
	('2022-03-23이재규', '이재규', '연차', '2022-03-23 00:00:00'),
	('2022-04-15이재규', '이재규', '연차', '2022-04-15 00:00:00'),
	('2022-05-13이재규', '이재규', '반차', '2022-05-13 00:00:00'),
	('2022-05-18이재규', '이재규', '연차', '2022-05-18 00:00:00');
/*!40000 ALTER TABLE `vacation_tb` ENABLE KEYS */;

/*!40101 SET SQL_MODE=IFNULL(@OLD_SQL_MODE, '') */;
/*!40014 SET FOREIGN_KEY_CHECKS=IFNULL(@OLD_FOREIGN_KEY_CHECKS, 1) */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40111 SET SQL_NOTES=IFNULL(@OLD_SQL_NOTES, 1) */;
